docs/test-results/phase4/unit6.7-extended-closed-formal/m2-n1120-ef1-rep1/k6-stdout.log
time="2026-08-29T11:06:51+09:00" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"maxDuration\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/user/Documents/GitHub/llm-concurrency-lab/load-test-k6/scenarios/04-phase4-closed-wave.js
        output: -

     scenarios: (100.00%) 1 scenario, 1120 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1120 iterations shared among 1120 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (00m40.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m00.5s/10m0s  0000/1120 shared iters

running (00m41.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m01.5s/10m0s  0000/1120 shared iters

running (00m42.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m02.5s/10m0s  0000/1120 shared iters

running (00m43.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m03.5s/10m0s  0000/1120 shared iters

running (00m44.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m04.5s/10m0s  0000/1120 shared iters

running (00m45.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m05.5s/10m0s  0000/1120 shared iters

running (00m46.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m06.5s/10m0s  0000/1120 shared iters

running (00m47.0s), 1120/1120 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1120 VUs  00m07.5s/10m0s  0000/1120 shared iters


  █ TOTAL RESULTS 

    CUSTOM
    client_actual_started_total................: 1120   23.393281/s
    client_completed_stream_duration_seconds...: avg=8.352617     min=8.175        med=8.374        max=8.455        p(90)=8.434        p(95)=8.439       
    client_completed_ttfc_seconds..............: avg=1.184499     min=1.015        med=1.19         max=1.303        p(90)=1.2591       p(95)=1.282       
    client_events_received_total...............: 40320  842.1581/s
    client_stream_completed_total..............: 1120   23.393281/s
    client_stream_duration_seconds.............: avg=8.352617     min=8.175        med=8.374        max=8.455        p(90)=8.434        p(95)=8.439       
    client_ttfc_seconds........................: avg=1.184499     min=1.015        med=1.19         max=1.303        p(90)=1.2591       p(95)=1.282       
    client_wave_start_epoch_ms.................: avg=496658h7m30s min=496658h7m30s med=496658h7m30s max=496658h7m30s p(90)=496658h7m30s p(95)=496658h7m30s
    sse_event..................................: 40500  845.917735/s

    HTTP
    http_req_duration..........................: avg=8.35s        min=7.87s        med=8.37s        max=8.45s        p(90)=8.43s        p(95)=8.43s       
    http_reqs..................................: 1125   23.497715/s

    EXECUTION
    iteration_duration.........................: avg=8.35s        min=8.17s        med=8.37s        max=8.45s        p(90)=8.43s        p(95)=8.43s       
    iterations.................................: 1120   23.393281/s
    vus........................................: 1120   min=0        max=1120
    vus_max....................................: 1120   min=1120     max=1120

    NETWORK
    data_received..............................: 4.8 MB 100 kB/s
    data_sent..................................: 303 kB 6.3 kB/s



running (00m47.9s), 0000/1120 VUs, 1120 complete and 0 interrupted iterations
default ✓ [ 100% ] 1120 VUs  00m08.5s/10m0s  1120/1120 shared iters